# ┌──────────────────────────────────────────────────────────────┐
# │ arpatek - Brewfile                                           │
# │ Run: brew bundle                                             │
# └──────────────────────────────────────────────────────────────┘

# ──[ Shell & Terminal ]────────────────────────────────────────────────────────
brew "zsh"
brew "tmux"

# ──[ Core Tools ]─────────────────────────────────────────────────────────────
brew "git"
brew "curl"
brew "wget"
brew "make"
brew "gcc"

# ──[ Modern CLI ]─────────────────────────────────────────────────────────────
brew "eza"
brew "lazygit"
brew "btop"
brew "ncdu"
brew "asciinema"
brew "tmate"
brew "yazi"
brew "fzf"
brew "zoxide"
brew "lynx"

# ──[ Editor ]─────────────────────────────────────────────────────────────────
brew "neovim"

# ──[ Languages ]──────────────────────────────────────────────────────────────
brew "go"
brew "pyenv"

# ──[ Fonts ]──────────────────────────────────────────────────────────────────
cask "font-jetbrains-mono-nerd-font"
