# ┌──────────────────────────────────────────────────────────────┐
# │ arpatek - Brewfile                                           │
# │ Run: brew bundle                                             │
# └──────────────────────────────────────────────────────────────┘

# ──[ Taps ]────────────────────────────────────────────────────────────────────
tap "waydabber/betterdisplay"

# ──[ Shell ]───────────────────────────────────────────────────────────────────
brew "bash"           # bash 4+ required by dotfiles scripts
brew "zsh"
brew "tmux"

# ──[ Core CLI ]────────────────────────────────────────────────────────────────
brew "git"
brew "curl"
brew "wget"
brew "aria2"
brew "tree"
brew "nmap"
brew "make"
brew "gcc"
brew "grep"           # GNU grep — enables grep -oP (Perl regex) on macOS

# ──[ Modern CLI ]──────────────────────────────────────────────────────────────
brew "bat"            # better cat with syntax highlighting
brew "eza"
brew "fastfetch"
brew "btop"
brew "ncdu"
brew "fzf"
brew "zoxide"
brew "lynx"
brew "shellcheck"
brew "shfmt"
brew "lazygit"
brew "yazi"
brew "asciinema"
brew "asciiquarium"

# ──[ Network & Tunnels ]───────────────────────────────────────────────────────
brew "cloudflared"
brew "mole"

# ──[ Languages & Runtimes ]────────────────────────────────────────────────────
brew "go"
brew "node"
brew "deno"
brew "pyenv"

# ──[ Containers ]──────────────────────────────────────────────────────────────
brew "docker"
brew "docker-completion"

# ──[ Media ]───────────────────────────────────────────────────────────────────
brew "ffmpeg"
brew "yt-dlp"

# ──[ Editors ]─────────────────────────────────────────────────────────────────
brew "neovim"

# ──[ VPN ]─────────────────────────────────────────────────────────────────────
brew "wireguard-tools"   # wg and wg-quick CLI — pulls in wireguard-go as dependency

# ──[ Fonts ]───────────────────────────────────────────────────────────────────
cask "font-jetbrains-mono-nerd-font"

# ──[ Terminals ]───────────────────────────────────────────────────────────────
cask "iterm2"

# ──[ Browsers ]────────────────────────────────────────────────────────────────
cask "firefox"
cask "zen"
cask "helium-browser"

# ──[ Editors & IDEs ]──────────────────────────────────────────────────────────
cask "visual-studio-code"
cask "zed"
cask "betterdisplay"

# ──[ AI Tools ]────────────────────────────────────────────────────────────────
cask "claude"
cask "chatgpt"

# ──[ Notes & Productivity ]────────────────────────────────────────────────────
cask "obsidian"

# ──[ Window Management ]───────────────────────────────────────────────────────
cask "aerospace"

# ──[ Media & Entertainment ]───────────────────────────────────────────────────
cask "iina"
cask "obs"
cask "steam"

# ──[ System Utilities ]────────────────────────────────────────────────────────
cask "keka"
cask "utm"

# ──[ Mac App Store ]───────────────────────────────────────────────────────────
brew "mas"
mas "Hidden Bar",   id: 1452453066
mas "Codye",        id: 1516894961
mas "WireGuard",    id: 1451685025
mas "Wipr 2",       id: 1662217862
mas "Amphetamine",  id: 937984704
mas "CleanMyMac",   id: 1339170533
